app/controllers/admins_controller.rb

  def create
  	@admin = Admin.new(admin_params)
	  if @admin.save
---
INSERT INTO "admins" ("email", "name", "password_salt", "password_hash", "created_at", "updated_at", "auth_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"