app/controllers/password_resets_controller.rb

    def create
  	  @admin = Admin.find_by_email(params[:email])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT 1  [["email", "mike.jec.it@gmail.com"]]

	def edit
	   @admin = Admin.find_by_password_reset_token!(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."password_reset_token" = $1 LIMIT 1  [["password_reset_token", "KbyisJKnXaDS2tE8QSIDMQ"]]

	def update
	  @admin = Admin.find_by_password_reset_token!(params[:id])
	  if @admin.password_reset_sent_at < 2.hours.ago
	    redirect_to new_password_reset_path, :alert => "Password reset has expired."
	  elsif @admin.update_attributes(user_params)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."password_reset_token" = $1 LIMIT 1  [["password_reset_token", "KbyisJKnXaDS2tE8QSIDMQ"]]
UPDATE "admins" SET "password_salt" = $1, "password_hash" = $2, "updated_at" = $3 WHERE "admins"."id" = $4  [["password_salt", "$2a$10$0.BWAUr9Y1/T.VJ0JHJiHu"], ["password_hash", "$2a$10$0.BWAUr9Y1/T.VJ0JHJiHunKU23kkr.fgoktuGAunvmH/lD4vZvlm"], ["updated_at", "2016-11-16 07:53:15.988177"], ["id", 2]]